# St7DeleteFreedomCase

Deletes the specified freedom case in the Strand7 model. Since freedom cases use contiguous numbering this will
cause all the following freedom case numbers to shift down by one.

long St7DeleteFreedomCase(long uID, long CaseNum)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Freedom case number.

Coordinate Systems